ИС_СПОРТ_2022/src/Documents/РегистрацияДостиженийСпортсменов/РегистрацияДостиженийСпортсменов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегистрацияДостиженийСпортсменов</name>
  <basedOn>Document.Соревнование</basedOn>
  <registerRecords>AccumulationRegister.ДостиженияСпортсменов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныйГод</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Соревнование</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Спортсмены</name>
    <attributes>
      <name>Спортсмен</name>
      <type>
        <types>CatalogRef.Спортсмены</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Достижения</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ХарактеристикиДостиженийСпортсменов</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ХарактеристикиДостиженийСпортсменов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиВнутренний</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/Documents/РегистрацияДостиженийСпортсменов/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"			, ДокументСсылка);
	Запрос.УстановитьПараметр("Организация"		, ДокументСсылка.Организация);
	Запрос.УстановитьПараметр("ВидСпорта"		, ДокументСсылка.ВидСпорта);
	Запрос.УстановитьПараметр("УчебныйГод"		, ДокументСсылка.УчебныйГод);
	Запрос.УстановитьПараметр("Соревнование"	, ДокументСсылка.ДокументОснование.Соревнование);
	Запрос.УстановитьПараметр("Период"			, ДокументСсылка.ДокументОснование.ДатаНачалаСоревнования);
	Запрос.УстановитьПараметр("ДокументОснование"		, ДокументСсылка.ДокументОснование);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Спортсмены.Спортсмен КАК Спортсмен,
	|	Спортсмены.КлючСтроки КАК КлючСтроки
	|ПОМЕСТИТЬ ВТ_Спортсмены
	|ИЗ
	|	Документ.РегистрацияДостиженийСпортсменов.Спортсмены КАК Спортсмены
	|ГДЕ
	|	Спортсмены.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Достижения.Характеристика КАК Характеристика,
	|	Достижения.Значение КАК Значение,
	|	Достижения.КлючСтроки КАК КлючСтроки
	|ПОМЕСТИТЬ ВТ_Достижения
	|ИЗ
	|	Документ.РегистрацияДостиженийСпортсменов.Достижения КАК Достижения
	|ГДЕ
	|	Достижения.Ссылка = &Ссылка
	|	И Достижения.Значение <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""ДостиженияСпортсменов"" КАК ИмяРегистра_,
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	&ВидСпорта КАК ВидСпорта,
	|	&УчебныйГод КАК УчебныйГод,
	|	&Соревнование КАК Соревнование,
	|	&ДокументОснование КАК ДокументОснование,
	|	ВТ_Спортсмены.Спортсмен КАК Спортсмен,
	|	ВТ_Достижения.Характеристика КАК Характеристика,
	|	ВТ_Достижения.Значение КАК Значение
	|ИЗ
	|	ВТ_Достижения КАК ВТ_Достижения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Спортсмены КАК ВТ_Спортсмены
	|		ПО ВТ_Достижения.КлючСтроки = ВТ_Спортсмены.КлючСтроки";
	
	ТаблицаДостижения = Запрос.Выполнить().Выгрузить();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаДостиженияСпортсменов", ТаблицаДостижения);
	
    ДополнительныеСвойства.Вставить("Отказ", Отказ);
	
КонецПроцедуры	

Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.РегистрацияДостиженийСпортсменов.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольПередПроведением(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.РегистрацияДостиженийСпортсменов.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовОтменыПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.РегистрацияДостиженийСпортсменов.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры
